app/Models/homemodel.php

    private function table_list_of_users_query()
    {
        // print_r($user_id);exit;
        $column_order = array();
        $column_search = array('name','username');
        $order     = array('');

        $this->builder = $this->db->table("users as T1")
        ->select('*')
        ->where('T1.user_delete', 'Active');


        $i = 0;
        // $postData       = $this->request->getPost();
        // loop searchable columns
        foreach ($column_search as $item) {
            // if datatable send POST for search
            if ($_POST['search']['value']) {
                // first loop
                if ($i === 0) {
                    // open bracket
                    $this->builder->groupStart();
---
SELECT *
FROM `users` as `T1`
WHERE `T1`.`user_delete` = 'Active'